alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
//===-- TMS320C64XIfConversion.cpp - Profile guided if conversion pass. ---===//
//
//                     The LLVM Compiler Infrastructure
//
// This file is distributed under the University of Illinois Open Source
// License. See LICENSE.TXT for details.
//
//===----------------------------------------------------------------------===//
//
// This file implements an if-conversion pass for the TMS320C64X target.
//
//===----------------------------------------------------------------------===//

#define DEBUG_TYPE "ifconversion"
#include "TMS320C64X.h"
#include "TMS320C64XTargetMachine.h"
#include "llvm/CodeGen/MachineFunctionPass.h"
#include "llvm/CodeGen/MachineInstr.h"
#include "llvm/CodeGen/MachineProfileAnalysis.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/MachineLoopInfo.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineRegions.h"
#include "llvm/CodeGen/MachineModuleInfo.h"
#include "llvm/CodeGen/SuperblockFormation.h"
#include "llvm/CodeGen/TailReplication.h"
#include "llvm/Target/TargetInstrItineraries.h"
#include "llvm/Support/CommandLine.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/raw_ostream.h"
#include "llvm/ADT/DepthFirstIterator.h"
#include "llvm/ADT/SmallSet.h"
#include "llvm/ADT/Statistic.h"
#include "llvm/ADT/STLExtras.h"
#include "llvm/MC/MCSymbol.h"
#include <list>

using namespace llvm;

static cl::opt<double>
ConversionLimit("ifconv-func-limit",
  cl::desc("Restrict percentage of if-conversions for each function"),
  cl::init(0.4), cl::Hidden);

static cl::opt<bool>
AggressiveConversion("ifconv-aggressive",
  cl::desc("Convert aggressively as much convertibles as possible"),
  cl::init(false), cl::Hidden);

static cl::opt<bool>
FastEstimation("ifconv-fast-estimation", 
  cl::desc("Use fast if-conversion profitability estimation"),
  cl::init(false), cl::Hidden);

static cl::opt<bool>
RunOnSuperblocks("ifconv-superblocks-only",
  cl::desc("Run the if-conversion on machine superblocks only"),
  cl::init(false), cl::Hidden);

STATISTIC(NumRemovedBranchesStat, "Number of removed branch instructions");
STATISTIC(NumPredicatedBlocksStat, "Number of predicated basic blocks");
STATISTIC(NumDuplicatedBlocksStat, "Number of duplicated basic blocks");

//------------------------------------------------------------------------------

namespace {

typedef std::pair<unsigned, unsigned> UIntPair;
typedef std::pair<unsigned, UIntPair> PHIEntryInfo;
typedef SmallVector<MachineOperand, 4> SmallPredVector;

// @enum CONVERSION_PREFERENCE: This enum is provided to improve readability
// of the code and is used to specify the preference for the conversion, i.e.
// which of both outcomes of a structure is to be preferred for conditional
// elimination, i.e. merging into the corresponding head block

enum CONVERSION_PREFERENCE {
  PREFER_FBB  = 0,
  PREFER_TBB  = 1,
  PREFER_ALL  = 2,
  PREFER_NONE = 3
};

//------------------------------------------------------------------------------

// @enum IF_STRUCTURE_TYPE: This enum is used to distinguish between various
// cfg patterns which are used for the if-conversion. We basically support
// open or closed variations of triangle and diamond patterns for the current
// implementation

enum IF_STRUCTURE_TYPE {
  BAD_IF_STRUCTURE  = 0,

  IF_TRIANGLE = 1,

  // For simplicity the FMBB is restricted to have at most 1 successor which
  // is the tail (TMBB). The number of predecessors is not limited. If FMBB
  // has more than 1 pred, it is tail-duplicated before conversion. The head
  // is not restricted, but the tail needs to have exactly 2 preds. We either
  // can merge FMBB into the head, collapse all three blocks together, or
  // disrupt the tail, creating an IF_OPEN construct if it seems to be more
  // promising

  /* IF_TRIANGLE:
        ...
         |
       head
      /   |
    FMBB  |
      \   |
       TMBB
         |
        ...
  */

  IF_DIAMOND = 2,

  // converting diamonds is slightly more complicated and usually less pro-
  // fitable. We again restrict one of the branch targets (FMBB/TMBB) to
  // have at most one successor. The number of preds is not limited. The
  // conversion procedure is similar to the procedure of convering IF_OPENs
  // with the difference, that we eventually can merge all blocks together,
  // which however is rarely profitable

  /* IF_DIAMOND:
       ...
        |
       head
      /   \
    FMBB TMBB
      \   /
       tail
        |
       ...
  */

  IF_OPEN = 3,

  // fortunately we can handle all variations of open-patters uniformly. We
  // restrict one of the blocks (FMBB or TMBB) to have exactly 1 successor,
  // the other block is not restricted. If this block (FMBB shown) has more
  // than 1 pred, it is eventually tail-duplicated before conversion. We con-
  // vert this structure by merging FMBB into the head and attaching (in the
  // function layout) TMBB to it. NOTE, that TMBB can also have no preds (it
  // is most probably a function exit), however we still convert it the same
  // way (predicating an exit node does not work well yet)

  /* IF_OPEN:
       ...
        |
       head
      /   \
    FMBB TMBB
     |   /  \ 
    ...   ...
  */
 
  NUM_IF_STRUCTURES = 4 
};

//------------------------------------------------------------------------------

// @struct BBInfo: To simplify analysis of particular basic blocks we provide
// a simple struct to record the relevant data for each basic block. We record
// simple facts like predicability/duplicability as well as the branch informa-
// tion if available

struct BBInfo {

  /// DATA

  MachineBasicBlock *MBB;

  bool conditional;
  bool analyzable;
  bool duplicable;
  bool predicable;
  bool predicated;

  unsigned size;
  unsigned cycles;

  MachineBasicBlock *branchTBB;
  MachineBasicBlock *branchFBB;

  SmallVector<MachineOperand, 4> branchCond;

  /// METHODS/ACCESSORS

  BBInfo(MachineBasicBlock *argMBB = 0)
  : MBB(argMBB),
    conditional(true),
    analyzable(true),
    duplicable(true),
    predicable(true),
    predicated(false),
    size(0),
    cycles(0),
    branchTBB(0),
    branchFBB(0)
  {}
};

//------------------------------------------------------------------------------

// @class IfConversionInfo - we use simple records to store valuable data for
// machine basic blocks being if-converted, such as execution frequency, pred
// info, etc. Additionally we keep track of any conversion actions suggested
// by the profitability analysis

struct IfConvertible {

  // structure identifier
  IF_STRUCTURE_TYPE type;

