alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
  // structure parts
  BBInfo headInfo;
  BBInfo TBBInfo;
  BBInfo FBBInfo;
  BBInfo tailInfo;

  IfConvertible(IF_STRUCTURE_TYPE T,
                BBInfo &head,
                BBInfo &TBB,
                BBInfo &FBB)
  : type(T),
    headInfo(head),
    TBBInfo(TBB),
    FBBInfo(FBB),
    tailInfo(BBInfo(0))
  {}

  IfConvertible(IF_STRUCTURE_TYPE T,
                BBInfo &head,
                BBInfo &TBB,
                BBInfo &FBB,
                BBInfo &tail)
  : type(T),
    headInfo(head),
    TBBInfo(TBB),
    FBBInfo(FBB),
    tailInfo(tail)
  {}
};

//------------------------------------------------------------------------------

// @class TMS320C64XIfConversion - Class for the profile-guided if-conversion
// pass for machine functions. Contains all the heavy machinery to extract,
// select, estimate and convert special if-patterns. Designed to be run on
// the machine-level, after the instruction selection, but before RA, so the
// SSA-formed code is assumed

class TMS320C64XIfConversion : public MachineFunctionPass {

  private:

    MachineProfileAnalysis *MPI;
    MachineLoopInfo *MLI;

    const TMS320C64XInstrInfo *TII;
    const InstrItineraryData *IID;

    // number of cycles for a branch
    const unsigned BRANCH_CYCLES;

    // this is a working list for all if-conversion candidates we have mana-
    // get to extract. This map is emptied and rebuild each iteration of the
    // if-converting algorithm (iterative). If profile information is availa-
    // ble, convertibles will be stored ascending by head's execution count
    std::multimap<unsigned, IfConvertible> candidateMap;

    // a temporary structure that maps machine basic blocks to their informa-
    // tion nodes. Each machine basic block meeting initial criteria will be
    // analyzed and stored within this map. The map is rebuilt each iteration
    std::map<MachineBasicBlock*, BBInfo> analyzedBlocks;

    // local function statistics
    unsigned NumRemovedBranches;
    unsigned NumPredicatedBlocks;
    unsigned NumDuplicatedBlocks;

  public:

    static char ID;

    // for the init-macro to shut up
    TMS320C64XIfConversion();

    // actual object ctor used for creating a pass instance
    TMS320C64XIfConversion(TMS320C64XTargetMachine &tm);
    ~TMS320C64XIfConversion() {}

    // Require profile information. This currently also includes an estima-
    // tor in case a real info is not available. Additonally require loop
    // information for checks during pattern selection
    virtual void getAnalysisUsage(AnalysisUsage &AU) const {
      if (!FastEstimation)
        AU.addRequired<MachineProfileAnalysis>();

      AU.addRequired<MachineLoopInfo>();
      MachineFunctionPass::getAnalysisUsage(AU);
    }

    virtual const char *getPassName() const {
      return "Profile guided if-conversion pass for the TMS320C64X target";
    }

    // one of the most popular functions within llvm. No further explanations   
    virtual bool runOnMachineFunction(MachineFunction &MF);

    // check and return a successor common to both specified basic blocks
    static MachineBasicBlock *getCommonSuccessor(MachineBasicBlock &A,
                                                 MachineBasicBlock &B);

    // check the specified machine basic block (MBB) and report whether it
    // has phi-instructions that contain values being defined within the spe-
    // cified source machine basic block
    static bool hasPHIEntriesForMBB(MachineBasicBlock *MBB,
                                    MachineBasicBlock *sourceMBB);

    // static helper, inspect the given machine phi-instruction for possible
    // values defined by the spefieid basic block. Upon success, return the
    // first index for the source register found
    static unsigned getPHISourceRegIndex(const MachineInstr &PHIInstr,
                                         MachineBasicBlock *sourceMBB);

    // specifies which of both branch outcomes (FBB or TBB) is to be prefered
    // for the condtional elimination. This block will subsequently be predi-
    // cated, adjusted and merged with the corresponding head block
    CONVERSION_PREFERENCE getConversionPreference(IfConvertible &IC);

    // provided for debugging purposes, this method prints the information
    // what machine basic blocks the given convertible structure consists of
    void printCandidate(const IfConvertible &candidate) const;

  private:

    // analyzes each machine basic block of the specified function, creates
    // a struct containing all the information relevant during the conver-
    // sion. All information structs are stored within a temp-map. The map
    // is rebuild by this function each iteration
    void analyzeMachineFunction(MachineFunction &MF);

    // given a list of already analyzed machine basic block and corresponding
    // information structs, this function tries to extract if-patterns. All
    // analyzed basic blocks are considered for the head of such a structure
    void extractFromMachineFunction();

    // alternatively, instead of converting the entire machine function, we
    // can restrict the pattern extraction on the created superblocks (if
    // any available). This is profitable for many cases and usually limits
    // the amount of additional duplication
    void extractFromSuperblocks();

    // inspects the given information struct about a machine basic block and
    // tries to extract a convertible pattern out of it, which is IF_OPEN,
    // IF_TRIANGLE or IF_DIAMONG. Each pattern suitable (in terms of the CFG)
    // is stored in a working list of convertible candidates
    void extractIfPattern(BBInfo &headBlock);

    // a handy helper whether it is profitable to duplicate the specified BB.
    // the estimation is done statically by inspecting the size of the block,
    // the number of its successors/predecessors, etc
    bool isProfitableToDuplicate(BBInfo &MBB) const;

    // another helper method that tells whether the specified source block
    // is mergeable into the specified destination block. I.e. whether its
    // CFG structure (predecessors/successors) is suitable (preds/succs/loop
    // backedges), whether it eventually can be duplicated, etc.
    bool canMergeBlock(BBInfo &srcBlockInfo, BBInfo &destBlockInfo) const;

    // additionally to 'canMergeBlock' this method checks whether specified
    // machine basic block can be predicated. This check is done for blocks
    // being candidates for a conversion
    bool canPredicateBlock(BBInfo &MBBInfo) const;

