alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
    // this helper method specifies whether we can skip predication of the
    // specified instruction. For example this is true for llvm-IR pseudo's
    // such as kill, imp-defs, or for target instrs such as special "labels".
    // Such instructions are left unconsidered for used heuristics
    bool isPredicatelessPseudoMI(const MachineInstr &MI) const;

    // this is another handy helper, which returns a side entry into 'tail',
    // different from specified predecessors 'skipPredA' and 'skipPredB', it
    // comes useful when duplicating basic blocks
    MachineBasicBlock *getSideEntryIntoTail(MachineBasicBlock *tail,
                                            MachineBasicBlock *skipPredA,
                                            MachineBasicBlock *skipPredB);

    // given a basic block (tail), inspect it for any phi-instructions that
    // have source values defined in the predecessors A and B. If yes, we do
    // remove them and return a set containing a phi-dest/source information
    // about all entries we have removed
    std::set<PHIEntryInfo> updatePHIs(BBInfo &A, BBInfo &B, BBInfo &tail);

    // after processing possible phi-instructions in a tail block, we need to
    // insert predicated copies into the specified block (BB) which is assumed
    // to be the only predecessor (most probably result of merging blocks) of
    // the tail. After inserting the copies, we have transformed all phi's
    // within the tail block without violating SSA properties of the code
    void insertPredCopies(BBInfo &BB,
                          std::set<PHIEntryInfo> &deadPhis,
                          SmallPredVector &predicates);

    // during the merge of basic blocks, some funny side-effects can arise.
    // This includes unconditional branches being predicated and yet not
    // recognized as conditional without being transformed explicitly into
    // branch_cond's. Additionally, since the branch is now conditional, its
    // fallthrough is most probably wrong. I.e. we need to insert yet another
    // branch. Another example - if conditionally terminated MBBs are allowed
    // is predicating a conditional two-way branch, resulting in a three-way
    // branch now...fun.
    void patchTerminators(BBInfo &head, BBInfo &succ,
                          SmallPredVector &predicates,
                          bool insertBranch = true);

    // given a list of predicates (we can only assign one predicate each ite-
    // ration for the time being), each instruction within specified block is
    // predicated. Already predicated instructions will be handled by folding
    // predicates/rewriting destinations
    void predicateBlock(BBInfo &MBB, SmallPredVector &predicates);

    // this method merges the tail block into the specified head-block. The
    // terminator of the head is dropped, all instructions within the tail
    // cloned and appended to the head and its terminator updated. After this
    // the tail block is erased from the function
    void mergeBlocks(BBInfo &head, BBInfo &tail);

    // given basic block is duplicated, all side entries (predecessors) into
    // the block are removed with exception of the predecessor we explicitly
    // want to keep (skipPred)
    void duplicateBlock(MachineBasicBlock *MBB, MachineBasicBlock *skipPred);

    // to simplify the converting process, we eliminate fallthrough's by ma-
    // king each transition explicit via branch instructions. Some of them
    // will subsequently be removed, however, this simplifies the conversion-
    // handling considerably...
    void removeUnterminatedFallthrough(BBInfo &MBBI);

    // inspect each candidate in the priority queue and if all conversion-
    // restrictions and profitability estimations hold, try to conver them.
    // Report success upon conversion. When converting aggressively, the en-
    // tire function will be converted as long this method reports true
    bool convertStructure(IfConvertible &candidate);
};

char TMS320C64XIfConversion::ID = 0;

} // end of anonymous namespace

//------------------------------------------------------------------------------

INITIALIZE_PASS_BEGIN(TMS320C64XIfConversion,
  "pi-if-conversion", "Profile guided if-conversion pass", false, false)
INITIALIZE_PASS_DEPENDENCY(MachineLoopInfo)
INITIALIZE_AG_DEPENDENCY(MachineProfileAnalysis)
INITIALIZE_PASS_END(TMS320C64XIfConversion, 
  "pi-if-conversion", "Profile guided if-conversion pass", false, false)

//------------------------------------------------------------------------------

FunctionPass *
llvm::createTMS320C64XIfConversionPass(TMS320C64XTargetMachine &tm) {
  return new TMS320C64XIfConversion(tm);
}

//------------------------------------------------------------------------------

TMS320C64XIfConversion::TMS320C64XIfConversion()
: MachineFunctionPass(ID),
  MPI(0),
  TII(0),
  IID(0),
  BRANCH_CYCLES(5)
{
  initializeTMS320C64XIfConversionPass(*PassRegistry::getPassRegistry());
}

//------------------------------------------------------------------------------

TMS320C64XIfConversion::TMS320C64XIfConversion(TMS320C64XTargetMachine &TM)
: MachineFunctionPass(ID),
  MPI(0),
  TII(TM.getInstrInfo()),
  IID(TM.getInstrItineraryData()),
  BRANCH_CYCLES(5)
{
  initializeTMS320C64XIfConversionPass(*PassRegistry::getPassRegistry());
}

//------------------------------------------------------------------------------
// printCandidate:
//
// A helper method handy for debugging purposes. It emits the name information
// about the specified if-convertible structure, i.e. names of the head/TBB/
// FBB/tail blocks the structure is built of

void
TMS320C64XIfConversion::printCandidate(const IfConvertible &candidate) const {

  assert(candidate.type != BAD_IF_STRUCTURE && "ERROR: bad if-structure!\n");

  dbgs() << "Parent function: " << candidate.headInfo.MBB->
    getParent()->getFunction()->getNameStr() << '\n';

  if (candidate.type == IF_TRIANGLE) dbgs() << "IF_TRIANGLE:\n";
  else if (candidate.type == IF_DIAMOND) dbgs() << "IF_DIAMOND:\n";
  else if (candidate.type == IF_OPEN) dbgs() << "IF_OPEN:\n";

  if (!candidate.headInfo.MBB) dbgs () << "  MBB: (null)\n";
  else dbgs() << "  MBB: " << candidate.headInfo.MBB->getName() << '\n';

  if (!candidate.TBBInfo.MBB) dbgs () << "  TBB: (null)\n";
  else dbgs() << "  TBB: " << candidate.TBBInfo.MBB->getName() << '\n';

  if (!candidate.FBBInfo.MBB) dbgs () << "  FBB: (null)\n";
  else dbgs() << "  FBB: " << candidate.FBBInfo.MBB->getName() << '\n';

  if (!candidate.tailInfo.MBB) dbgs () << "  tail: (null)\n";
  else dbgs() << "  tail: " << candidate.tailInfo.MBB->getName() << '\n';
  dbgs() << '\n';
}

//------------------------------------------------------------------------------
// getCommonSuccessor:
//
// This helper method returns the first successor which is preceeded (in terms
// of control flow) by both specified machine basic blocks. There can be more
// than 1 common succ, however, for our demands it is sufficient to return the
// first encountered one

MachineBasicBlock *
TMS320C64XIfConversion::getCommonSuccessor(MachineBasicBlock &FBB,
                                           MachineBasicBlock &TBB)
{
  if (!FBB.succ_size() || !TBB.succ_size()) return 0;

  MachineBasicBlock::succ_iterator SI;
  for (SI = FBB.succ_begin(); SI != FBB.succ_end(); ++SI)
    if (TBB.isSuccessor(*SI)) return *SI;
  return 0;
}

//------------------------------------------------------------------------------
// isPredicatelessPseudoMI:
//
// Returns whenter a given machine instruction can be skipped during predi-
// cation process. This is true for some llvm-pseudo artifacts such as kill
// or implicit defs or target pseudos. Note, this actually also includes any
// IR copies, however we do handle them separately

bool
TMS320C64XIfConversion::isPredicatelessPseudoMI(const MachineInstr &MI) const {
  switch (MI.getOpcode()) {
    case TargetOpcode::KILL:
    case TargetOpcode::IMPLICIT_DEF:
    case TMS320C64X::call_return_label:
      return true;
    default: return false;
  }
}

//------------------------------------------------------------------------------
// removeUnterminatedFallthrough:
// 
// To simplify some of the conversion steps, it is useful to remove any fall-
// throughs and make transitions between basic blocks explicit. This is done
// by appending an unconditional branch to the end of the specified block.
// The branch-destination is the layout successor within the parent function

