alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
void TMS320C64XIfConversion::removeUnterminatedFallthrough(BBInfo &infoMBB) {
  MachineBasicBlock *MBB = infoMBB.MBB;
  assert(MBB && "Cant remove fallthrough, bad block!");

  // can not handle, if already terminated. NOTE, that we only handle blocks
  // having no terminators at all, i.e. we skip conditionally
  if (MBB->getFirstTerminator() != MBB->end()) return;

  // track the position of the next block for the fallthrough transition
  MachineFunction::iterator nextMBB = ++MachineFunction::iterator(MBB);
  assert(nextMBB != MBB->getParent()->end() && "Invalid block position!");

  MachineInstr *branchMI = TII->addDefaultPred(BuildMI(*MBB,
    MBB->end(), DebugLoc(), TII->get(TMS320C64X::branch)).addMBB(nextMBB));
  DEBUG(dbgs() << "Removed fallthrough: " << *branchMI << '\n');
}

//------------------------------------------------------------------------------
// analyzeMachineFunction:
//
// iterate over all machine basic blocks of the given function, collect the
// information about it (such as predicable/predicated/num succs/preds, etc).
// If the block is not generally suitable for the further processing (such
// as when having cycles, or a low execution count) the block is skipped, if
// not, its instructions are inspected and the information used for the if-
// conversion generated (branch structure, duplicability/predicability, etc)
 
void TMS320C64XIfConversion::analyzeMachineFunction(MachineFunction &MF) {

  for (MachineFunction::iterator MBBI = MF.begin(); MBBI != MF.end(); ++MBBI) {

    MachineBasicBlock *MBB = &*MBBI;
    assert(MBB && "Bad block detected, something is really fishy here!");

    // do not permit trivial MBB cycles
    if (MBB->isSuccessor(MBB)) continue;

    // this check is provided to skip "dead" blocks which do not seem to have
    // any predecessors and are not the entry blocks for the machine function
    if (MBBI->getBasicBlock() != &(MF.getFunction()->getEntryBlock()))
      if (!MBB->pred_size()) continue;

    BBInfo blockInfo(MBB);
    SmallSet<UIntPair, 8> usedPreds;
    MachineBasicBlock::iterator MI;

    for (MI = MBB->begin(); MI != MBB->end(); ++MI) {

      // also skip instructions, which can but do not need to be predicated.
      // this includes stuff like kill, implicit-def or target pseudos such
      // as returning pads for indirect jumps. This does not include PHIs or
      // copies, these will require special attention later
      if (MI->isDebugValue() || isPredicatelessPseudoMI(*MI)) continue;

      // handle a copy separately, a copy will probably expand to a target-
      // move later, therefore we consider it for our estimaton heuristic by
      // comparing its execution cycles to a regular physical register move
      if (MI->getOpcode() == TargetOpcode::COPY || MI->isPHI()) {
        blockInfo.cycles++;
        continue;
      }

      // track any machine instructions that we can not predicate (such as
      // calls, rets, etc.). NOTE, that this does not include any pseudos
      if (!TII->isPredicable(MI)) {
        DEBUG(dbgs() << "Analysis: can't predicate instruction " << *MI);
        blockInfo.predicable = false;
      }

      const TargetInstrDesc &MID = MI->getDesc();

      // record if eventually we already have predicated this basic block
      // once. NOTE, the TMS-target uses predication for conditional jumps.
      // Thus, we do not consider any terminators and record non-terminators
      // only
      if (TII->isPredicated(MI) && !MID.isConditionalBranch()) {

        blockInfo.predicated = true;
        const int predIndex = MI->findFirstPredOperandIdx();
        assert(predIndex != -1 && "Predicated MI without a predicate!");

        MachineOperand &predImmMO = MI->getOperand(predIndex);
        MachineOperand &predRegMO = MI->getOperand(predIndex + 1);

        // aquire predicate register and predicate val for the instruction
        assert(predRegMO.isReg() && predImmMO.isImm() && "Bad predicates!");
        const unsigned pReg = predRegMO.getReg();
        const unsigned pImm = predImmMO.getImm();

        // save the set of (different) predicates already used by this bb,
        // this is useful in order to help control the register pressure
        if (!usedPreds.count(UIntPair(pReg, pImm)) && usedPreds.size() < 4)
          usedPreds.insert(UIntPair(pReg, pImm));
      }

      // limit the number of used predicates in a basic block
      if (usedPreds.size() > 3) blockInfo.predicable = false;

      if (MID.hasUnmodeledSideEffects() || MID.isNotDuplicable())
        blockInfo.duplicable = false;

      // now estimate the number of execution cycles required for the current
      // machine basic block. We aquire this information from the target.
      blockInfo.cycles += TII->getInstrLatency(IID, MI);
      blockInfo.size++;
    }

    MachineBasicBlock *TBB = 0;
    MachineBasicBlock *FBB = 0;
    SmallVector<MachineOperand, 4> Cond;

    const bool isAnalyzable = !TII->AnalyzeBranch(*MBB, TBB, FBB, Cond, 0);

    blockInfo.conditional = Cond.size();
    blockInfo.analyzable = isAnalyzable;

    // if the branch is conditional, the target may fold the branch, if any
    // of the branch destinations is a layout follower. This makes one of the
    // TBB/FBB blocks 0. Check explicitly and assign target blocks properly
    if (blockInfo.conditional && isAnalyzable) {
      if (!TBB && !FBB) llvm_unreachable("Cond. branch without targets!");

      // make branch targets explicit for simplicity of analysis steps
      if (!FBB) FBB = llvm::next(MachineFunction::iterator(MBB));
      else if (!TBB) TBB = llvm::next(MachineFunction::iterator(MBB));

      // double check for sure, strange things happen when iterating across
      // parent function boundaries (llvm::next). So, check successors here,
      // they have to be within the same parent of course
      assert(TBB && FBB && "Incomplete targets for a conditional branch!");
      assert(MBB->isSuccessor(TBB) && MBB->isSuccessor(FBB) && "No mercy!");
    }

