alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
    blockInfo.branchTBB = TBB;
    blockInfo.branchFBB = FBB;
    blockInfo.branchCond = Cond;

    analyzedBlocks.insert(std::make_pair(MBB, blockInfo));
  }
}

//------------------------------------------------------------------------------
// extractFromMachineFunction:
//
// given a list of already analyzed machine basic block and corresponding
// information structs, this function tries to extract if-patterns. All ana-
// lyzed basic blocks are considered for the head of such a structure

void TMS320C64XIfConversion::extractFromMachineFunction() {
  std::map<MachineBasicBlock*, BBInfo>::iterator BI;
  for (BI = analyzedBlocks.begin(); BI != analyzedBlocks.end(); ++BI) {
    assert(BI->first && "Can not extract pattern, bad block detected!");
    extractIfPattern(BI->second);
  }
}

//------------------------------------------------------------------------------
// extractFromSuperblocks:
//
// alternatively, instead of converting the entire machine function, we can
// restrict the pattern extraction on the created superblocks (if any avai-
// lable). This can be profitable for many cases and usually limits the amount
// of code expansion when tail-duplicating

void TMS320C64XIfConversion::extractFromSuperblocks() {

  const MachineSuperBlockMapTy &superblocks =
    SuperblockFormation::getSuperblocks();

  if (!superblocks.size()) return;

  // extract in decreasing order, we start with the most frequent one
  for (MachineSuperBlockMapTy::const_iterator SB = superblocks.begin();
       SB != superblocks.end(); ++SB)
  {
    MachineSuperBlock *MSB = SB->second;
    assert(MSB && "Invalid basic block detected within a superblock!");

    // inspect the superblock-blocks now
    MachineSuperBlock::iterator MBBI;
    for (MBBI = MSB->begin(); MBBI != MSB->end(); ++MBBI) {
      std::map<MachineBasicBlock*, BBInfo>::iterator
        blockInfoPos = analyzedBlocks.find(*MBBI);

      if (blockInfoPos != analyzedBlocks.end())
        extractIfPattern(blockInfoPos->second);
    }
  }
}

//------------------------------------------------------------------------------
// extractIfPattern:
//
// Given an already (properly) analyzed machine basic block, this function
// tries to extract a convertible if-pattern out of it. It does not pay too
// much attention to profitability yet, but simply checks for general conver-
// sion constraints

void TMS320C64XIfConversion::extractIfPattern(BBInfo &head) {

  if (!head.conditional || !head.analyzable || head.MBB->succ_size() != 2)
    return;

  // check for the targets, both of them must have been set propertly
  assert(head.branchTBB && head.branchFBB && "Bad branch-targets!");
  assert(head.branchTBB != head.branchFBB && "Strange double-edge!");

  // there must not be cycles between branch targets
  if (head.branchTBB->isSuccessor(head.branchFBB)
  && (head.branchFBB->isSuccessor(head.branchTBB))) return;

  // also, we can not fold nodes properly yet, whose both branch outcomes
  // are leafs (usually function-exit blocks). Folding such nodes seem to
  // result in heavy inconsistencies within llvm, therefore, skip them now
  if (!head.branchTBB->succ_size() && !head.branchFBB->succ_size())
    return;

  std::map<MachineBasicBlock*, BBInfo>::iterator
    TBBI = analyzedBlocks.find(head.branchTBB),
    FBBI = analyzedBlocks.find(head.branchFBB);

  if (TBBI == analyzedBlocks.end() || FBBI == analyzedBlocks.end())
    return;

  unsigned headCount = MPI ? MPI->getExecutionCount(head.MBB) : 0;

  BBInfo infoTBB = TBBI->second;
  BBInfo infoFBB = FBBI->second;

  /// now after doing the initial preselection, we can try to extract conver-
  /// sion patterns. If both outcomes share a common successor, we then are
  /// dealing with a diamond. If one of the branch targets is a successor of
  /// another one then we have a triangle. All other cases result in varia-
  /// tions of open patterns

  if (infoTBB.MBB->isSuccessor(infoFBB.MBB)
  || infoFBB.MBB->isSuccessor(infoTBB.MBB)) {

    // usually, the tail is TBB, and (mostly fallthrough) block FBB. Reverse
    // positions if this is not the case (which won't happen frequent but is
    // still possible)
    if (infoTBB.MBB->isSuccessor(infoFBB.MBB)) {
      BBInfo tmp = infoTBB;
      infoTBB = infoFBB;
      infoFBB = tmp;
    }

    // FBB is neither predicable nor mergeable, therefore give up...
    if (!(canPredicateBlock(infoFBB) && canMergeBlock(infoTBB, head)))
      return;

    // in case we require a duplication of the convMBB-block, the tail block
    // will get an additional predecessor. We limit the number of total side
    // entries into the tail to 1, i.e. the max number of preds to be 3
    unsigned maxNumSideEntries = 2 + (infoFBB.MBB->pred_size() == 1);
    if (infoTBB.MBB->pred_size() > maxNumSideEntries) return;
                
    candidateMap.insert(std::make_pair(headCount,
      IfConvertible(IF_TRIANGLE, head, infoTBB, infoFBB)));
  }
  else {

    MachineBasicBlock *tailMBB =
      getCommonSuccessor(*infoTBB.MBB, *infoFBB.MBB);

    const bool canConvertTBB =
      canPredicateBlock(infoTBB) && canMergeBlock(infoTBB, head);

    const bool canConvertFBB =
      canPredicateBlock(infoFBB) && canMergeBlock(infoFBB, head);

    // tough luck, give it up and go home, crusader
    if (!canConvertTBB && !canConvertFBB) return;

    if (!tailMBB) {
      candidateMap.insert(std::make_pair(headCount, 
        IfConvertible(IF_OPEN, head, infoTBB, infoFBB)));
    }
    else {
      // since we are going to predicate both blocks, require both of them to
      // be mergeable and predicable. for the time being we only allow simple
      // conversions, collapsing all blocks into the head
      if (!canConvertTBB || !canConvertFBB) return;

      // if there is a common successor-block, we obviously have a diamond
      // here. Converting diamonds is slightly more complicated and conver-
      // ting them entirely is rarely being very profitable, we probably
      // can gain most of the conversion by doing stepwise, i.e. we first
      // merge one of the outcomes into the head, thus creating a triangle,
      // and then check whether it is profitable to reduce this triangle
      // into a straight line code
      std::map<MachineBasicBlock*, BBInfo>::iterator
        tailMBBI = analyzedBlocks.find(tailMBB);

      if (tailMBBI == analyzedBlocks.end()) return;

      BBInfo &tail = tailMBBI->second;

      // i hope, checking for FBB is sufficient...
      if (!canMergeBlock(tail, infoFBB)) return;

      const unsigned maxNumSideEntries =
        (infoTBB.MBB->pred_size() > 1) + (infoFBB.MBB->pred_size() > 1);

