alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
      // here too, we only handle 1 side entry into the tail right now. This
      // tail entry can result from duplication of the either the FBB or TBB
      // block, or exist 'naturally' without any duplication
      if (tailMBB->pred_size() + maxNumSideEntries > 3) return;

      candidateMap.insert(std::make_pair(headCount,
        IfConvertible(IF_DIAMOND, head, infoTBB, infoFBB, tail)));
    }
  }
}

//------------------------------------------------------------------------------
// canMergeBlock:
//
// A simple helper method to determine whether we can generally merge speci-
// fied block (src) into another one (dst). For this to be true, the block is
// required to have some basic properties as well as the ability to be dupli-
// cable eventually

bool
TMS320C64XIfConversion::canMergeBlock(BBInfo &srcInfo, BBInfo &dstInfo) const {

  if (!srcInfo.MBB || !srcInfo.analyzable) return false;
  if (srcInfo.MBB->getBasicBlock()->hasAddressTaken()) return false;

  // in case of side-entries, we eventually can convert the structure by
  // removing them via a tail-duplication. I.e. require MBB to be duplicable
  if ((srcInfo.MBB->pred_size() > 1) && !srcInfo.duplicable) return false;

  // additionally we avoid merging parent-loop header blocks into the head,
  // this complicates matters when it comes to phi-adjustment and is rarely
  // really profitable, therefore reject such cases
  assert(MLI && "Can't check for backedges without loop-info!");
  assert(srcInfo.MBB && dstInfo.MBB && "Invalid backedge blocks!");

  if (MLI->isLoopHeader(srcInfo.MBB)) {
    // this check is probably sufficient for nat. loops...
    const int dstLoopDepth = MLI->getLoopDepth(dstInfo.MBB);
    const int srcLoopDepth = MLI->getLoopDepth(srcInfo.MBB);
    return srcLoopDepth < dstLoopDepth;
  }
  return true;
}

//------------------------------------------------------------------------------
// canPredicateBlock:
//
// Another helper similar to 'canMergeBlock'. This one checks whether we can
// predicate the given machine basic block

bool TMS320C64XIfConversion::canPredicateBlock(BBInfo &MBBInfo) const {
  // for simplicity we also limit the number of successors...
  return MBBInfo.predicable && MBBInfo.MBB->succ_size() == 1;
}

//------------------------------------------------------------------------------
// hasPHIEntriesForMBB:
//
// A simple helper method for checking whether there are any phi-instructions
// within 'MBB' that have source values defined in 'sourceMBB'. These checks
// may come very handy especially when doing a conversion of triangles and
// beating/converting phi-instructions

bool TMS320C64XIfConversion::hasPHIEntriesForMBB(MachineBasicBlock *MBB,
                                                 MachineBasicBlock *sourceMBB)
{
  if (!MBB || !sourceMBB) return false;

  MachineBasicBlock::iterator MI;
  for (MI = MBB->begin(); MI != MBB->end() && MI->isPHI(); ++MI)
    if (getPHISourceRegIndex(*MI, sourceMBB)) return true;
  return false;
}

//------------------------------------------------------------------------------
// getSideEntryIntoTail:
//
// This method is used to aquire a side entry basic block into the specified
// tail, which is useful when converting triangles. A side entry block has to
// be different from both of the specified predecessors

MachineBasicBlock*
TMS320C64XIfConversion::getSideEntryIntoTail(MachineBasicBlock *tailMBB,
                                             MachineBasicBlock *skipPredA,
                                             MachineBasicBlock *skipPredB)
{
  MachineBasicBlock::pred_iterator PI;
  for (PI = tailMBB->pred_begin(); PI != tailMBB->pred_end(); ++PI)
    if (*PI != skipPredA && *PI != skipPredB && *PI != tailMBB) return *PI;
  return 0;
}

//------------------------------------------------------------------------------
// isProfitableToDuplicate:
//
// Estimate whether it is profitable to duplicate the specified block. For the
// time being, we use a simple static heuristic for the estimation in order to
// control the code size expansion. NOTE, this is most probably best to be mo-
// ved to the TargetInstrInfo file in future

bool TMS320C64XIfConversion::isProfitableToDuplicate(BBInfo &blockInfo) const {
  if (!blockInfo.duplicable) return false;

  // avoid inserting too many additional branches
  if (blockInfo.MBB->succ_size() > 8) return false;
  if (blockInfo.MBB->pred_size() > 8) return false;

  // avoid duplicating really big blocks
  if (blockInfo.size > 64) return false;

  // restrict the number of duplicated blocks to 20 percent for now...
  const double growthRatio = blockInfo.MBB->getParent()->size() * 0.2;
  if (NumDuplicatedBlocks > growthRatio) return false;

  return true;
}

//------------------------------------------------------------------------------
// getPHISourceRegIndex:
//
// Another handy helper when fucking around with phi-instructions during con-
// version. The specified machine instruction 'PHIInstr' is inspected for any
// incoming values from 'sourceMBB'. If one can be found, its operand-index
// is returned. Otherwise the result is 0. NOTE, this is the same implemen-
// tation that is currently found within CodeGen/TailReplication and is most
// probably best removed in future

unsigned
TMS320C64XIfConversion::getPHISourceRegIndex(const MachineInstr &PHIInstr,
                                             MachineBasicBlock *sourceMBB)
{
  assert(PHIInstr.isPHI() && "Can only process phi-instructions!");

  // look for the operand index for the register corresponding to the speci-
  // fied machine basic block within the specified machine instruction
  for (unsigned I = 1; I < PHIInstr.getNumOperands(); I += 2)
    if (PHIInstr.getOperand(I + 1).getMBB() == sourceMBB) return I;
  return 0;
}

//------------------------------------------------------------------------------
// getConversionPreference:
//
// Given a specified info struct about a basic block (which is assumed to be
// a head of a convertible structure, its branching structure is inspected
// and analyzed with respect to the profitability/execution counts. Depending
// on this analysis a suggestion is given whether and what to convert

