alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
CONVERSION_PREFERENCE
TMS320C64XIfConversion::getConversionPreference(IfConvertible &candidate) {

  BBInfo &headBBI = candidate.headInfo;
  BBInfo &infoFBB = candidate.FBBInfo;
  BBInfo &infoTBB = candidate.TBBInfo;

  if (candidate.type == BAD_IF_STRUCTURE) return PREFER_NONE;
  assert(headBBI.MBB && infoFBB.MBB && infoTBB.MBB && "Invalid blocks!");

  // for the time being we can only convert blocks which have 1 succ
  if (infoFBB.MBB->succ_size() != 1 && infoTBB.MBB->succ_size() != 1)
    return PREFER_NONE;

  double execFreqFBB = 0.0;
  double execFreqTBB = 0.0;
  double execFreqHead = 0.0;

  // for a fast estimation we only require the machine-loop-analysis to be
  // present. We inspect the program structure and decide upon block proper-
  // ties such as being a loop header, nesting level, etc.
  if (FastEstimation) {

    MachineBasicBlock *FBB = infoFBB.MBB;
    MachineBasicBlock *TBB = infoTBB.MBB;

    // estimate exec. frequency (prefer deeper nested blocks)
    execFreqFBB = (MLI->getLoopDepth(FBB) * 100.0) + 1.0;
    execFreqTBB = (MLI->getLoopDepth(TBB) * 100.0) + 1.0;

    MachineLoop *mlFBB = MLI->getLoopFor(FBB);
    MachineLoop *mlTBB = MLI->getLoopFor(TBB);

    // backedges to the headers are usually more frequent than non-backedges,
    // NOTE, that we do not yet prefer header-blocks over non-header blocks
    if (mlFBB && FBB->isSuccessor(mlFBB->getHeader())) execFreqFBB *= 10.0;
    if (mlTBB && TBB->isSuccessor(mlTBB->getHeader())) execFreqTBB *= 10.0;

    // finally, consider predecessor num
    execFreqFBB *= (FBB->pred_size() + 1.0);
    execFreqTBB *= (TBB->pred_size() + 1.0);
    execFreqHead = execFreqFBB + execFreqTBB;
  }
  else {
    // for a profile based estimation, we use basic block counts for now, but
    // will probably change later to use profiled weights for edges between
    // machine basic blocks
    execFreqFBB = MPI->getExecutionCount(infoFBB.MBB);
    execFreqTBB = MPI->getExecutionCount(infoTBB.MBB);
    execFreqHead = MPI->getExecutionCount(headBBI.MBB);
  }

  unsigned sizeLimit = AggressiveConversion ? 128 : 64;

  if (candidate.type == IF_OPEN) {
/*
    dbgs() << "=========================================================\n";
    dbgs() << "Weight of '" << headBBI.MBB->getName() << "': "
           << execFreqHead << '\n';

    dbgs() << "Weight of '" << infoFBB.MBB->getName() << "': "
           << execFreqFBB << '\n';

    dbgs() << "Weight of '" << infoTBB.MBB->getName() << "': "
           << execFreqTBB << '\n';

    dbgs() << "FBB-cycles: " << (int) infoFBB.cycles << '\n';
    dbgs() << "TBB-cycles: " << (int) infoTBB.cycles << '\n';
    dbgs() << "=========================================================\n";
*/
    // estimating open patterns is rather simple, since we can only merge
    // one branch target into the head and append the other to this combo.
    // I use a simple formula here and hope it to be effective...
    if (headBBI.size + infoFBB.size <= sizeLimit)
      if (BRANCH_CYCLES * execFreqFBB > execFreqTBB * infoFBB.cycles)
        if (canPredicateBlock(infoFBB) && canMergeBlock(infoFBB, headBBI))
          return PREFER_FBB;

    // now try another way around, check whether TBB is profitable
    if (headBBI.size + infoTBB.size <= sizeLimit)
      if (BRANCH_CYCLES * execFreqTBB > execFreqFBB * infoTBB.cycles)
        if (canPredicateBlock(infoTBB) && canMergeBlock(infoTBB, headBBI))
          return PREFER_TBB;
  }
  else if (candidate.type == IF_TRIANGLE) {

    // estimating triangles is a slightly different story, for now we only
    // consider opportunities where we can merge both blocks (FBB and tail
    // into the head). NOTE, we always refer the tail block as TBB here !
    const unsigned cycleLimit = infoFBB.cycles / AggressiveConversion + 1;

    // more restrictive for non-fast estimations, fast estimations usually
    // seem to profit from less tight bounds (obtained experimentally...),
    // these ones however don't
    if (headBBI.size + infoFBB.size + infoTBB.size <= sizeLimit)
      if (execFreqHead * BRANCH_CYCLES > execFreqTBB * cycleLimit)
        return PREFER_ALL;
  }
  else if (candidate.type == IF_DIAMOND) {

    // diamonds are rarely being really profitable. To simplify matters, we
    // only consider diamond-structures which either can completely be col-
    // lapsed into a single block, or disrupted by splitting the tail block
    const unsigned cycleLimit = (execFreqTBB * infoFBB.cycles +
                 execFreqFBB * infoTBB.cycles) / AggressiveConversion + 1;

    // attempt to control register pressure a poor man's way...
    if (headBBI.size + infoFBB.size + infoTBB.size <= sizeLimit)
      if (execFreqHead * BRANCH_CYCLES > cycleLimit)
        return PREFER_ALL;
  }
  return PREFER_NONE;
}

//------------------------------------------------------------------------------
// duplicateBlock:
//
// The specified basic block (i.e. tail) will be duplicated (@TailReplication)
// so all edges except from the specified predecessor (pred) will be redirec-
// ted to the cloned block. TODO, additionally, the profiling information will
// be adjusted, so the conversion can continue plausibly after the duplication

void TMS320C64XIfConversion::duplicateBlock(MachineBasicBlock *tail,
                                            MachineBasicBlock *pred)
{
  assert(tail && pred && "Can not duplicate, bad blocks specified!");

  TailReplication tailReplicator(TII);
  tailReplicator.duplicateTail(*pred, *tail);

  assert(tail->pred_size() == 1 && "Unallowed side entries found!");
  DEBUG(dbgs() << "Duplicated block: " << tail->getName() << '\n');

  ++NumDuplicatedBlocks;
}

//------------------------------------------------------------------------------
// updatePHIs:
//
// When converting triangles, it may become necessary to update phi-instruc-
// tions of the tail-block. If the tail block contains phi-entries for the
// FBB and the head, and if both are merged by the conversion, we then need
// to deal with a situation of phi-nodes having different source values from
// the same source block.
//
// regX = phi(regY:blockTBB, regZ:blockFBB)
//
// To allow merging 'blockTBB' and 'blockFBB' we save the destination 'regX'
// together with the source values 'regY' and 'regZ' appropriately within a
// temp set. Later conversion steps will then use this information and per-
// form something like this:
//
// [ pred] regX = regY
// [!pred] regX = regZ
//
// The original phi-instruction can then be dropped completely. Using a
// pseudo-instruction for this mutually-exclusive predicated move allows us
// to avoid the single-assignment restriction and offers a semantic equiva-
// lent to a two-entry-phi node, without beating yet with a full psi-SSA
// implementation

std::set<PHIEntryInfo> TMS320C64XIfConversion::updatePHIs(BBInfo &sourceTBB,
                                                          BBInfo &sourceFBB,
                                                          BBInfo &tailInfo)
{
  MachineBasicBlock *MBB = tailInfo.MBB;
  MachineBasicBlock *TBB = sourceTBB.MBB;
  MachineBasicBlock *FBB = sourceFBB.MBB;

  assert(MBB && TBB && FBB && "Can not rewrite phi's, bad blocks!");

  std::set<PHIEntryInfo> replacedPhisInfo;
  std::list<MachineInstr*> deadPhis;

  MachineBasicBlock::iterator MI;
  for (MI = MBB->begin(); MI != MBB->end() && MI->isPHI(); ++MI) {

    unsigned indexTBB = getPHISourceRegIndex(*MI, FBB);
    unsigned indexFBB = getPHISourceRegIndex(*MI, TBB);

    if (indexTBB && indexFBB) {

