alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
      // get the destination of the phi instruction. Additionally we create
      // an entry for the later update. While we could have done it here in-
      // line, we dont, to improve the readability and structure of the code
      unsigned destReg = MI->getOperand(0).getReg();
      unsigned valueTBB = MI->getOperand(indexTBB).getReg();
      unsigned valueFBB = MI->getOperand(indexFBB).getReg();

      PHIEntryInfo PEI(destReg, std::make_pair(valueTBB, valueFBB));
      assert(!replacedPhisInfo.count(PEI) && "Multiple phi's to remove!");
      replacedPhisInfo.insert(PEI);

      // we expect the phi-instruction to have entries for sourceA/B only !
      // Then, we can safely remove the current phi instruction from the MBB
      assert(MI->getNumOperands() < 6 && "Bad phi-instruction detected!");
      deadPhis.push_back(MI);
    }
  }

  // now drop all phi-instructions from the tail block that now are "dead".
  // NOTE, this can make the basic blocks empty ! Be sure to run a DCE or
  // something similar after this !
  for(std::list<MachineInstr*>::iterator FIRST_DEAD = deadPhis.begin(),
      LAST_DEAD = deadPhis.end(); FIRST_DEAD != LAST_DEAD; ++FIRST_DEAD)
  {
    DEBUG(dbgs() << "Erased phi-instruction: " << *FIRST_DEAD);
    (*FIRST_DEAD)->eraseFromParent();
  }

  return replacedPhisInfo;
}

//------------------------------------------------------------------------------
// insertPredCopies:
//
// When a tail block has phi-values from two predecessors, we need to handle
// the predication properly, because when merging predecessors there will be
// multiple source values incoming from one source block. To solve this prob-
// lem we remove the phi-entries from the instruction and insert predicated
// copies into the merged predecessor. See 'updatePHIs' 

void TMS320C64XIfConversion::insertPredCopies(BBInfo &blockInfo,
                                              std::set<PHIEntryInfo> &deadPhis,
                                              SmallPredVector &predicates)
{
  MachineBasicBlock *MBB = blockInfo.MBB;
  assert(blockInfo.MBB && "Can not insert copies, bad basic block!");

  // now iterate over the specified set of "dead" phi instruction infos, get
  // the values for the former destinations and source values and insert pre-
  // dicated pseudo-copies for each of them
  std::set<PHIEntryInfo>::iterator PI;
  for (PI = deadPhis.begin(); PI != deadPhis.end(); ++PI) {

    const unsigned destReg = PI->first;
    const unsigned sourceRegTBB = PI->second.first;
    const unsigned sourceRegFBB = PI->second.second;

    // now create a new predicated reg-copy for the given set of registers,
    // and append it to the end of the specified block (before the termina-
    // tor). We need to pay attention to predicate the instruction properly!
    MachineInstr *predSelectMI = BuildMI(*MBB, MBB->getFirstTerminator(),
      DebugLoc(), TII->get(TMS320C64X::mvselect), destReg)
        .addReg(sourceRegTBB).addReg(sourceRegFBB);

    if (!TII->PredicateInstruction(predSelectMI, predicates))
      DEBUG(dbgs() << "Can not predicate pred-move MI" << *predSelectMI);

    DEBUG(dbgs() << "Inserted a pred-reg-select MI: " << *predSelectMI);
  }
}

//------------------------------------------------------------------------------
// predicateBlock:
//
// Given a basic block information and a list of predicates (right now we are
// only able to assign one single predicate at a time) each instruction in the
// block is predicated. Special care must be taken, if there are instructions
// already predicated (in this case we fold predicates by 'selecting' them),
// and also in cases, when the block is (unconditionally) terminated. Predi-
// cating the branch instruction will semantically turn it into a conditional
// branch, i.e. we may need to pay attention to the following fallthrough...

void TMS320C64XIfConversion::predicateBlock(BBInfo &blockInfo,
                                            SmallPredVector &predicates)
{
  assert(blockInfo.MBB && "Can not if-convert, bad basic block found!");
  DEBUG(dbgs() << "Predicating block: " << blockInfo.MBB->getName() << '\n');

  MachineBasicBlock &MBB = *blockInfo.MBB;
  MachineRegisterInfo &MRI = MBB.getParent()->getRegInfo();
  DenseMap<UIntPair, UIntPair> handledPreds;

  /// now iterate over all instructions in the block and assign predicates
  /// to them. If we have inserted custom select-pred instructions above, we
  /// need to skip them, since we have attached a predicated to them already.
  /// also, if the block ends with a conditional branch, we also leave it un-
  /// touched, also due to the predicated folding performed earlier

  for (MachineBasicBlock::iterator MI = MBB.begin(); MI != MBB.end(); ++MI) {
    if (MI->isDebugValue() || MI->isPHI() || MI->isInlineAsm()) continue;

    const int op = MI->getOpcode();

    // we also skip any llvm-intermed. pseudos such as for example kill.
    // also skip any pseudo-real machine instructions (such as ret-labels)
    if (isPredicatelessPseudoMI(*MI) || op == TargetOpcode::COPY) continue;

    assert(!MI->getDesc().isConditionalBranch() && "Save my nerves please");

    if (TII->isPredicated(MI)) {
      DEBUG(dbgs() << "Predicated MI found: " << *MI << '\n');

      /// in case we encounter an instruction which is already predicated, we
      /// basically need to decide, since we can do two things. We can connect
      /// involved predicates (already used one and a new one we are going to
      /// assign) logically by and-/or-ing. This is good when there are few
      /// large pools of already predicated instructions using different pre-
      /// dicates, since this increases pressure on predicate-registers. This
      /// is bad if there are only few of them. Alternatively, you can "rew-
      /// rite" instructions to write into a new destination register and then
      /// insert a predicated move which transfers the content into the orig.
      /// destination. This effectively doubles the number of predicated inst-
      /// ructions and therefore increases register pressure on the GPR's.
      /// For the time being we implement the first variant, which seem to
      /// make more sense for common cases. In order to avoid predicate re-
      /// gister pressure explosion, we limit the number of predicates used
      /// in a block to 3

      const int predIndex = MI->findFirstPredOperandIdx();
      assert(predIndex != -1 && "Predicated MI without a predicate!");

