alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
      MachineOperand &usedPredImmMO = MI->getOperand(predIndex);
      MachineOperand &usedPredRegMO = MI->getOperand(predIndex + 1);
      assert(usedPredRegMO.getReg() != predicates[1].getReg());

      // get predicate register and predicate value
      const unsigned miPredReg = usedPredRegMO.getReg();
      const unsigned miPredImm = usedPredImmMO.getImm();

      DenseMap<UIntPair, UIntPair>::iterator PI =
        handledPreds.find(UIntPair(miPredReg, miPredImm));

      if (PI == handledPreds.end()) {

        // if predicate is not yet handled, we need to do it now and to fold
        // both source predicates properly. Additionally the folded predicate
        // will be saved

        MachineBasicBlock::iterator insertPos = MI;
        const unsigned newPredImm = predicates[0].getImm();
        const unsigned newPredReg = predicates[1].getReg();

        const TargetRegisterClass *RC = MRI.getRegClass(miPredReg);
        const unsigned foldedPredReg = MRI.createVirtualRegister(RC);
        unsigned foldedPredVal = 1;

        if (miPredImm && newPredImm) {

          // if both immediates are positive, use an AND to fold them, this
          // folded predicate itself needs to stay unpredicated and will be
          // used as a new predication operand for the instruction
          MachineInstr *andMI = TII->addDefaultPred(BuildMI(MBB, MI,
            DebugLoc(), TII->get(TMS320C64X::and_p_rr), foldedPredReg)
              .addReg(miPredReg).addReg(newPredReg));

          DEBUG(dbgs() << "AND-folded predicate: " << *andMI);
        }
        else if (!(miPredImm || newPredImm)) {

          // if in contrast  both immediates are negative, use a NOR to fold
          // both. There is no native NOR for the TMS target, we therefore
          // can emit a NOT-OR chain, but even this is not necessary. We can
          // flip the pred value itself and fold by OR
          MachineInstr *orMI = TII->addDefaultPred(BuildMI(MBB, MI,
            DebugLoc(), TII->get(TMS320C64X::or_p_rr), foldedPredReg)
              .addReg(miPredReg).addReg(newPredReg));

          foldedPredVal = 0;

          DEBUG(dbgs() << "NOR-folded predicate: " << *orMI);
        }
        else if (miPredImm && !newPredImm) {

          // if only one of the source preds is negative, we can use the TMS
          // native ANDN instruction which ands a first source with an inver-
          // sion of a second source
          MachineInstr *andnMI = TMS320C64XInstrInfo::addFormOp(
            TII->addDefaultPred(BuildMI(MBB, MI, DebugLoc(),
              TII->get(TMS320C64X::andn_rr_1), foldedPredReg)
                .addReg(miPredReg).addReg(newPredReg)),
                   TMS320C64XII::unit_s, false);

          DEBUG(dbgs() << "ANDN-folded predicate: " << *andnMI);
        }
        else if (!miPredImm && newPredImm) {
          // similar to the case above, just use a andn instruction
          MachineInstr *andnMI = TMS320C64XInstrInfo::addFormOp(
            TII->addDefaultPred(BuildMI(MBB, MI, DebugLoc(),
              TII->get(TMS320C64X::andn_rr_1), foldedPredReg)
                .addReg(newPredReg).addReg(miPredReg)),
                   TMS320C64XII::unit_s, false);

          DEBUG(dbgs() << "ANDN-folded predicate: " << *andnMI);
        }

        // path predicate operands of the instruction now, NOTE, that the
        // predicate folding instruction (and, nor, andn) itself goes unpre-
        // dicated and the imm value for the predicate is always 1!
        usedPredRegMO.setReg(foldedPredReg);
        usedPredImmMO.setImm(foldedPredVal);

        // save newly folded pred register/value
        handledPreds.insert(std::make_pair(
          UIntPair(miPredReg, miPredImm),
          UIntPair(foldedPredReg, foldedPredVal)));
      }
      else {
        // if we have folded both source predicates already for an earlier
        // instruction, then, simply get and use it now
        usedPredRegMO.setReg(PI->second.first);
        usedPredImmMO.setImm(PI->second.second);
      }
    }
    else if (!TII->PredicateInstruction(&*MI, predicates))
      DEBUG(dbgs() << "Can't predicate instruction: " << *MI);
  }

  NumPredicatedBlocks++;
}

//------------------------------------------------------------------------------
// mergeBlocks:
//
// Given two basic blocks we merge the 'tail' into the 'head'. This is done by
// cloning each instruction, updating the successor-information and also up-
// dating the phi-information for each succesor. After this procedure the tail
// block is dropped from the parent function completely and is gone forever

void TMS320C64XIfConversion::mergeBlocks(BBInfo &head, BBInfo &tail) {

  MachineBasicBlock *headMBB = head.MBB, *tailMBB = tail.MBB;
  assert(headMBB && tailMBB && "Bad machine blocks detected!");

  // again, we require the block which is to be duplicated to have no side-
  // entries, this should have been rejected earlier during the analysis...
  assert(tailMBB->pred_size() <= 1 && "Unallowed side entry detected!");

  // drop the branching instruction, and count properly
  if ((headMBB->getFirstTerminator() != headMBB->end())
  && (!headMBB->getFirstTerminator()->getDesc().isReturn())) {
    TII->RemoveBranch(*headMBB);
    ++NumRemovedBranches;
  }

  if (headMBB->isSuccessor(tailMBB)) headMBB->removeSuccessor(tailMBB);

  // leaving things up to the codegen for correction is probably not going to
  // work well, therefore we correct things manually here. Next, we duplica-
  // te all instructions from the tail into the head block
  MachineBasicBlock::iterator tailMI;
  for (tailMI = tailMBB->begin(); tailMI != tailMBB->end(); ++tailMI) {

    // in some cases, when after the duplication the tail contains phi's with
    // just one source value, we fold these phi-instructions into reg copies
    if (tailMI->isPHI()) {

      assert(tailMI->getNumOperands() == 3 && "Malformed phi-instruction!");
      unsigned destReg = tailMI->getOperand(0).getReg();
      unsigned srcReg = tailMI->getOperand(1).getReg();

      // insert a soft-register copy in-place of the phi-instruction
      MachineInstr *copyMI = BuildMI(*headMBB, headMBB->end(), DebugLoc(),
        TII->get(TargetOpcode::COPY), destReg).addReg(srcReg);

      DEBUG(dbgs() << "Replaced a phi by a copy-MI: " << *copyMI);
    }
    else {
      MachineFunction &MF = *(headMBB->getParent());
      MachineInstr *newHeadMI = TII->duplicate(tailMI, MF);
      headMBB->push_back(newHeadMI);
    }
  }

  // next, a successor-update is necessary. All successors of the tail block
  // are changed now to succeed the head instead. Can not change them in-line,
  // therefore we copy them ahead
  SmallVector<MachineBasicBlock*, 32> Succs(
    tailMBB->succ_begin(), tailMBB->succ_end());

  for (unsigned SI = 0; SI < Succs.size(); ++SI) {
    MachineBasicBlock *succ = Succs[SI];

    // transfer unique successor blocks, avoid double edges. Additionally we
    // are required to update any phi nodes for the side exits of the tail,
    // the entries originally containing values for the tail block will now
    // contain values for the head
    if (!headMBB->isSuccessor(succ)) {
      headMBB->addSuccessor(succ);

      MachineBasicBlock::iterator succMI;
      for (succMI = succ->begin(); succMI != succ->end(); ++succMI) {
        if (!succMI->isPHI()) continue;

        // just to ensure consistency, no single phi-entries from the head
        assert(!getPHISourceRegIndex(*succMI, headMBB) && "Bad boy dump!");

        // find the operand source for the tail within the phi-instruction
        const unsigned phiIndex = getPHISourceRegIndex(*succMI, tailMBB);
        if (!phiIndex) continue;

        DEBUG(dbgs() << "Adjusting successor's phi-node for the"
                     << " machine instruction: " << *succMI);

        MachineOperand &mbbMO = succMI->getOperand(phiIndex + 1);
        assert(mbbMO.isMBB() && "Bad phi operand (not a machine block)!");
        mbbMO.setMBB(headMBB);
      }
    }

    tailMBB->removeSuccessor(succ);
  }

