alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
  tailMBB->eraseFromParent();
}

//------------------------------------------------------------------------------
// patchTerminators:
//
// After two blocks have been merged we eventually have to update the termi-
// nator structure of the resulting block. This includes converting any pre-
// dicated branch instructions into explicit conditional branches and then
// inserting (if desired) an unconditional branch to the specified successor

void TMS320C64XIfConversion::patchTerminators(BBInfo &infoMBB,
                                              BBInfo &infoSucc,
                                              SmallPredVector &predicates,
                                              bool insertExplicitBranch)
{
  MachineBasicBlock *MBB = infoMBB.MBB;
  MachineBasicBlock *succ = infoSucc.MBB;
  assert(MBB && succ && "Can not patch terminators, invalid blocks!");

  // note, that we assume the head basic block to be terminated...
  assert(MBB->getFirstTerminator() != MBB->end() && "No fallthrough's!");

  // in case we have predicated a block, which was terminated by an uncondi-
  // tional branch, we now have turned it into an unconditional one which
  // uses a predicate. Semantically, this is conditional now, however, to
  // make llvm understand this, we need to make it explicitly. I.e. we con-
  // vert an unconditional branch with a predicate into a conditional one,
  // i.e. branch [pred] -> branch_cond [pred]. TODO, consider predicated re-
  // gister branches too !
  if (MBB->size() && MBB->back().getOpcode() == TMS320C64X::branch) {
    MachineBasicBlock *TBB = MBB->back().getOperand(0).getMBB();
    assert(TBB && "Bad branch operand detected!");
    MBB->back().eraseFromParent();

    // addition, if insertion of an explicit terminating branch is desired,
    // and if the successor-block is the same as the destination of the
    // conditional branch, we drop the last and simply insert an uncondi-
    // tional branch to the successor. Such a case will happen frequently
    // when converting triangles
    if (TBB != infoSucc.MBB) {
      MachineInstr *branchMI = BuildMI(*MBB, MBB->end(), DebugLoc(),
        TII->get(TMS320C64X::branch_cond)).addMBB(TBB)
          .addImm(predicates[0].getImm()).addReg(predicates[1].getReg());
      DEBUG(dbgs() << "Rewritten predicated branch: " << *branchMI);
    }
  }

  // to express the relationship between blocks explicitly, if desired, we do
  // insert an unconditional branch to the specified successor. This removes
  // fallthroughs but allows us to move blocks freely during subsequent con-
  // version-iterations
  if (insertExplicitBranch) {
    assert(MBB->isSuccessor(succ) && "Must branch to a successor!");

    MachineInstr *branchMI = TII->addDefaultPred(BuildMI(*MBB,
      MBB->end(), DebugLoc(), TII->get(TMS320C64X::branch)).addMBB(succ));
    DEBUG(dbgs() << "Inserted unconditional branch: " << *branchMI);
  }
}

//------------------------------------------------------------------------------
// convertStructure:
//
// This is the main function where the entire conversion machinery is initia-
// ted. Given a conversion-candidate we distinguish between different patterns
// and if the profitability is given, try to convert it accordingly. For some
// patterns there are various conversion ways, to keep things simple we only
// consider the most important/promising ones

bool TMS320C64XIfConversion::convertStructure(IfConvertible &candidate) {

  // now ask the smart lil guy what he would do with the current structure.
  // for open structures, we basically can convert the true and/or false
  // machine basic blocks but not both
  CONVERSION_PREFERENCE preference = getConversionPreference(candidate);

  SmallVector<MachineOperand, 4> Cond = candidate.headInfo.branchCond;
  assert(Cond.size() && Cond[0].isImm() && Cond[1].isReg());

  BBInfo &head = candidate.headInfo;

  if (candidate.type == IF_DIAMOND) {

    /// usually, it is rarely profitable to convert diamonds into a straight
    /// line code segment. For the time being we only support the collapsing
    /// of the diamond into one single block. Only max 1 side-entry is allo-
    /// wed into the tail (which will be duplicated)

    if (preference != PREFER_ALL) return false;

    BBInfo &convTBB = candidate.TBBInfo;
    BBInfo &convFBB = candidate.FBBInfo;
    BBInfo &tail = candidate.tailInfo;

    assert(convFBB.MBB->succ_size() == 1 && convTBB.MBB->succ_size() == 1);
    assert(convFBB.MBB->pred_size() == 1 || convTBB.MBB->pred_size() == 1);
    assert(tail.MBB->pred_size() <= 3 && "Can only handle 1 side entry!");

    BBInfo sideEntry = convTBB;
    if (convFBB.MBB->pred_size() > 1) sideEntry = convFBB;

    if (sideEntry.MBB->pred_size() > 1 && tail.MBB->pred_size() < 3) {
      if (isProfitableToDuplicate(sideEntry)
      && isProfitableToDuplicate(tail)) {
        // duplicate both basic blocks now
        duplicateBlock(sideEntry.MBB, head.MBB);
        duplicateBlock(tail.MBB,
          getSideEntryIntoTail(tail.MBB, convFBB.MBB, convTBB.MBB));
        return true;
      } else return false;
    }

    // can not collapse tail if there are any side entries. Therefore dupli-
    // cate it before conversion. To keep things simple, we do not handle the
    // clone analysis inline, simply signal for a start of a new iteration
    if (tail.MBB->pred_size() > 2) {
      if (isProfitableToDuplicate(tail)) {
        // duplicate tail only
        duplicateBlock(tail.MBB,
          getSideEntryIntoTail(tail.MBB, convTBB.MBB, convFBB.MBB));
        return true;
      } else return false;
    }

    // we need to be careful to reverse the predicates if necessary...
    if (head.branchTBB == convFBB.MBB) Cond[0].setImm(!Cond[0].getImm());

    predicateBlock(convTBB, Cond);

    // reverse and predicate TBB now...
    Cond[0].setImm(!Cond[0].getImm());
    predicateBlock(convFBB, Cond);

    // if the tail does have any phi-entries from both specified blocks, we
    // need to remove them, since both blocks are going to be collapsed la-
    // ter. Collect information about dropped phi-instructions !
    std::set<PHIEntryInfo> deadPhis = updatePHIs(convTBB, convFBB, tail);

    // if there are any of dead phi-instructions, we remove them and insert
    // predicated-copy pseudo instruction to the block we intend to merge
    // (last !) into the head (in our case FBB)
    if (deadPhis.size()) insertPredCopies(convFBB, deadPhis, Cond);

    // now do the merging stuff
    mergeBlocks(head, convTBB);
    mergeBlocks(head, convFBB);
    mergeBlocks(head, tail);
    head.MBB->updateTerminator();
    return true;
  }
  else if (candidate.type == IF_OPEN) {

