alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XIfConversion.cpp
    if (preference != PREFER_FBB && preference != PREFER_TBB)
      return false;

    /// here we have a structure with both branch outcomes not sharing any
    /// immediate successors. We can convert either of the both branch tar-
    /// gets and need to select the most profitable one

    BBInfo conv = candidate.TBBInfo;
    BBInfo skip = candidate.FBBInfo;

    if (preference == PREFER_FBB) {
      conv = candidate.FBBInfo;
      skip = candidate.TBBInfo;
    }

    assert(conv.MBB->succ_size() == 1 && "Bad IF-OPEN struct!");

    // for simplicity insert an explicit branch if the candidate block is
    // falling through to another one and has no terminator instructions at
    // all. This complicates the uniform handling a bit, therefore, remove
    removeUnterminatedFallthrough(conv);

    if (conv.MBB->pred_size() > 1) {
      if (isProfitableToDuplicate(conv)) {
        duplicateBlock(conv.MBB, head.MBB);
        return true;
      } else return false;
    }

    // do a double check, there must not be any phi-entries from one branch-
    // alternative in the other, i.e. convBBI must not contain any phi values
    // from skipBBI and vice-versa
    assert(!hasPHIEntriesForMBB(conv.MBB, skip.MBB)
      && !hasPHIEntriesForMBB(skip.MBB, conv.MBB)
      && "Uncle Willie says...Phi or not to phi");

    // we need to be careful to reverse the predicates if necessary...
    if (head.branchTBB == skip.MBB) Cond[0].setImm(!Cond[0].getImm());

    // now run conversion steps
    predicateBlock(conv, Cond);
    mergeBlocks(head, conv);
    patchTerminators(head, skip, Cond);
    return true;
  }
  else if (candidate.type == IF_TRIANGLE) {

    /// for the time being to keep things simple, we only consider cases for
    /// a conversion where we can merge both branch targets into the head.
    /// This assumes a profitability being given as well as a number of suc-
    /// cessors/predecessors being suitable

    if (preference != PREFER_ALL) return false;

    BBInfo conv = candidate.FBBInfo;
    BBInfo tail = candidate.TBBInfo;

    assert(tail.MBB->pred_size() <= 3 && "Too many preds for the tail!");

    // we eventually will have to duplicate the conv and the tail block, we do
    // it atomically for efficiency. NOTE, that duplicating 'conv' will indu-
    // ce an additional side-entry into the tail !
    if (conv.MBB->pred_size() > 1 && tail.MBB->pred_size () < 3) {
      if (isProfitableToDuplicate(conv) && isProfitableToDuplicate(tail)) {
        // duplicate both basic blocks now
        duplicateBlock(conv.MBB, head.MBB);
        duplicateBlock(tail.MBB,
          getSideEntryIntoTail(tail.MBB, conv.MBB, head.MBB));

        return true;
      } else return false;
    }

    // here we duplicate the tail only, i.e. in case when there are no side
    // entries into the conv block, but one side entry exists into the tail
    if (tail.MBB->pred_size() > 2) {
      if (isProfitableToDuplicate(tail)) {
        // duplicate tail only
        duplicateBlock(tail.MBB,
          getSideEntryIntoTail(tail.MBB, conv.MBB, head.MBB));

        return true;
      } else return false;
    }

    // usually, the branch goes to the tail, i.e. the tail being the TRUE-
    // destination and the conv-block being the FALSE (in most of the cases
    // a fallthrough) one. However, sometimes due to heavy conversions, there
    // can be opposite cases, this requires us to reverse the predicate value
    if (head.branchTBB == tail.MBB) Cond[0].setImm(!Cond[0].getImm());

    predicateBlock(conv, Cond);

    // the same stuff as for diamond-conversion, update phis here
    std::set<PHIEntryInfo> deadPhis = updatePHIs(head, conv, tail);
    if (deadPhis.size()) insertPredCopies(conv, deadPhis, Cond);

    // NOTE, tail unpredicated
    mergeBlocks(head, conv);
    mergeBlocks(head, tail);
    head.MBB->updateTerminator();
    return true;
  }
  return false;
}

//------------------------------------------------------------------------------

bool TMS320C64XIfConversion::runOnMachineFunction(MachineFunction &MF) {

  NumRemovedBranches = 0;
  NumPredicatedBlocks = 0;
  NumDuplicatedBlocks = 0;

  if (!FastEstimation) MPI = &getAnalysis<MachineProfileAnalysis>();

  MLI = &getAnalysis<MachineLoopInfo>();

  DEBUG(dbgs() << "Run 'TMS320C64XIfConversion' pass for '"
               << MF.getFunction()->getNameStr() << "'\n");

  // get the percentage of maximum allowed conversions
  double conversionPercentLimit = ConversionLimit;
  if (conversionPercentLimit < 0 || conversionPercentLimit > 1.0)
    conversionPercentLimit = 0.25;

  unsigned maxConversions = MF.size() * ConversionLimit;
  bool continueConversion = true;

  while (continueConversion) {

    candidateMap.clear();
    analyzedBlocks.clear();

    // extract basic information about basic blocks, such as contained in-
    // structions, number of successors/predecessors, conditional termina-
    // tors, used predicates, etc.
    analyzeMachineFunction(MF);

    if (RunOnSuperblocks) extractFromSuperblocks();
    else extractFromMachineFunction();

    // now iterate over all identified convertible structures (triangles,
    // diamonds, etc.) and try to if-convert them if the conversion seems
    // to be profitable
    std::multimap<unsigned, IfConvertible>::reverse_iterator J;

    bool conversionDone = false;

    for (J = candidateMap.rbegin(); J != candidateMap.rend(); ++J) {
      if (convertStructure(J->second)) {
        DEBUG(dbgs() << "Converted:\n"; printCandidate(J->second));
        conversionDone = true;

//        ++convcount;
        break;
      }
    }

    if (!conversionDone) break;

    // convert aggressively/exhaustively if desired to do so, otherwise limit
    // the number of conversions per function to the number specified on the
    // command line by the user...
    if (AggressiveConversion) continueConversion = true;
    else continueConversion = --maxConversions > 0;
  }

  // update the global if-conversion statistics
  NumRemovedBranchesStat += NumRemovedBranches;
  NumPredicatedBlocksStat += NumPredicatedBlocks;
  NumDuplicatedBlocksStat += NumDuplicatedBlocks;
  return NumRemovedBranches || NumDuplicatedBlocks;
} 

#undef DEBUG_TYPE

